app/Http/Controllers/Auth/LoginController.php

    public function loginFormTwo()
    {
        $school = app('school');
        $data = [];

        $login_background = AramiscBackgroundSetting::where('school_id', $school->id)->where([['is_default', 1], ['title', 'Login Background']])->first();
---
select * from `sm_background_settings` where `school_id` = 1 and (`is_default` = 1 and `title` = 'Login Background') limit 1