app/Http/Middleware/CheckMaintenanceMode.php

    public function handle(Request $request, Closure $next): Response
    {
//        $c = Storage::exists('.app_installed') ? Storage::get('.app_installed') : false;
//        if (!$c) {
//            return $next($request);
//        }
        if(auth()->user() && auth()->user()->is_administrator =="yes"){
            return $next($request);
        }

        if($this->inExceptArray($request)){
            return $next($request);
        }

        $school = SaasSchool();
        $setting = MaintenanceSetting::first();
---
select * from `maintenance_settings` limit 1