app/View/Components/Course.php

select * from `sm_course_categories` where `sm_course_categories`.`id` in (0)
select * from `sm_courses` where `school_id` = 1 order by `id` asc limit 4
---
    public function render(): View|Closure|string
    {
         $courses = AramiscCourse::query();
         $courses->where('school_id', app('school')->id)->with('courseCategory');
         if($this->sorting =='asc'){
            $courses->orderBy('id','asc');
         }
         elseif($this->sorting =='desc'){
            $courses->orderBy('id','desc');
         }
         else{
            $courses->inRandomOrder();
         }
        $courses = $courses->take($this->count)->get();