app/View/Components/HeaderContentMenu.php

    public function render(): View|Closure|string
    {
        $menus = AramiscHeaderMenuManager::where('school_id', app('school')->id)->where('theme', 'edulia')->whereNull('parent_id')->orderBy('position')->get();
---
select * from `sm_header_menu_managers` where `school_id` = 1 and `theme` = 'edulia' and `parent_id` is null order by `position` asc