app/View/Components/News.php

    public function render(): View|Closure|string
    {
        $news = AramiscNews::query();
        $news->where('school_id', app('school')->id)->where('status', 1);

        if($this->sorting =='asc'){
            $news->orderBy('id','asc');
        }
        elseif($this->sorting =='desc'){
            $news->orderBy('id','desc');
        }
        else{
            $news->inRandomOrder();
        }

        $news = $news->take($this->count)->get();
---
select * from `sm_news` where `school_id` = 1 and `status` = 1 order by `id` asc limit 3