app/View/Components/PhotoGallery.php

select * from `sm_photo_galleries` where `parent_id` is null and `school_id` = 1 order by `position` asc limit 4
---
    public function render(): View|Closure|string
    {
        $photoGalleries = AramiscPhotoGallery::where('parent_id', '=', null)
                        ->where('school_id', app('school')->id)
                        ->take($this->count)
                        ->orderBy('position')
                        ->get();