app/View/Components/TeacherList.php

select * from `sm_expert_teachers` where `school_id` = 1 order by `position` asc limit 4
---
    public function render(): View|Closure|string
    {
        $staffs = AramiscExpertTeacher::where('school_id', app('school')->id)
                ->with('staff.designations')
                ->take($this->count)
                ->orderBy('position')
                ->get();