app/View/Components/Testimonial.php

    public function render(): View|Closure|string
    {
        $testimonials = AramiscTestimonial::query();
        $testimonials ->where('school_id', app('school')->id);
        if($this->sorting =='asc'){
            $testimonials->orderBy('id','asc');
        }
        elseif($this->sorting =='desc'){
            $testimonials->orderBy('id','desc');
        }
        else{
            $testimonials->inRandomOrder();
        }

        $testimonials = $testimonials->take($this->count)->get(['name', 'designation', 'institution_name', 'image', 'description', 'star_rating', 'school_id']);
---
select `name`, `designation`, `institution_name`, `image`, `description`, `star_rating`, `school_id` from `sm_testimonials` where `school_id` = 1 order by `id` asc limit 3