app/View/Components/VideoGallery.php

    public function render(): View|Closure|string
    {

        $videoGalleries = AramiscVideoGallery::where('school_id', app('school')->id)
                        ->take($this->count)
                        ->orderBy('position')
                        ->get();
---
select * from `sm_video_galleries` where `school_id` = 1 order by `position` asc limit 3