app/Helpers/Helper.php

select * from `infix_module_managers` where `name` = 'BehaviourRecords' limit 1
---
    function moduleStatusCheck($module)
    {
        try {
            $all_module = session()->get('all_module');
            $moduleStatus = true;

            if (empty($all_module)) {
                $all_module = [];
                $modules = InfixModuleManager::select('name')->get();
                foreach ($modules as $m) {
                    $all_module[] = $m->name;
                }

                session()->put('all_module', $all_module);
            }

            $is_module_available = 'Modules/' . $module . '/Providers/' . $module . 'ServiceProvider.php';
            if (file_exists($is_module_available)) {
                $moduleStatus = Module::find($module)->isDisabled();
            }

            if (!in_array($module, $all_module) || $moduleStatus) {
                return false;
            }

            $is_verify = Cache::rememberForever('module_' . $module, function () use ($module) {
                return InfixModuleManager::where('name', $module)->first();

select `date_format_id` from `sm_general_settings` where `id` = 1 limit 1
select `format` from `sm_date_formats` where `id` = 1 limit 1
---
    function dateConvert($input_date)
    {
        try {
            $system_date_format = session()->get('system_date_format');
            if (empty($system_date_format)) {
                $date_format_id = AramiscGeneralSettings::where('id', 1)->first(['date_format_id'])->date_format_id;
                $system_date_format = AramiscDateFormat::where('id', $date_format_id)->first(['format'])->format;

select * from `users` where `role_id` = 1 and `school_id` = 1 limit 1
---
    function getUserLanguage()
    {

        if (Auth::check()) {
            return userLanguage();
        } else {
            $school_id = app()->bound('school') ? app('school')->id : 1;
            $user = User::where('role_id', 1)->where('school_id', $school_id)->first();

select * from `users` where `role_id` = 1 and `school_id` = 1 limit 1
---
    function userRtlLtl()
    {
        // return 1;

        if (session()->has('user_text_direction')) {
            return session()->get('user_text_direction');
        } else {
            $school_id = app()->bound('school') ? app('school')->id : 1;
            $user = User::where('role_id', 1)->where('school_id', $school_id)->first();

select * from `sm_schools` where `sm_schools`.`id` = 1 limit 1
---
        }

        if (!$school) {
            $school = Auth::check() ? auth()->user()->school : \App\AramiscSchool::findOrFail(1);