app/Providers/AppServiceProvider.php

            });

            view()->composer(['backEnd.partials.menu', 'layouts.pb-site', 'frontEnd.home.front_master'], function ($view) {
                $pluginCheck = Plugin::whereIn('name',['tawk', 'messenger'])->where('school_id',app('school')->id)->get();
---
select * from `plugins` where `name` in ('tawk', 'messenger') and `school_id` = 1